{
  "title": "Congedo di Maternità Obbligatoria",
  "evaluation_mode": "incremental",
  "steps": [
    {
      "var": "profilo_lavoratore",
      "ask": "Qual è la tua situazione lavorativa attuale? Scegli tra: dipendente_privato, gestione_separata, autonomo, naspi, dipendente_pubblico, altro",
      "type": "string"
    },

    {
      "var": "in_gravidanza",
      "ask": "Sei attualmente in stato di gravidanza? (sì/no)",
      "type": "boolean",
      "skip_if": "profilo_lavoratore === 'dipendente_pubblico' || profilo_lavoratore === 'altro'"
    },

    {
      "var": "fase_gravidanza_dipendente",
      "ask": "In che fase ti trovi? Scegli tra: prima_parto (circa 2 mesi prima della DPP), dopo_parto (dopo il parto), maternita_anticipata (se richiesta dal datore di lavoro)",
      "type": "string",
      "skip_if": "profilo_lavoratore !== 'dipendente_privato'"
    },

    {
      "var": "contributi_gestione_separata",
      "ask": "Hai versato almeno 1 contributo mensile con aliquota maggiorata alla Gestione Separata nei 12 mesi precedenti la maternità? (sì/no)",
      "type": "boolean",
      "skip_if": "profilo_lavoratore !== 'gestione_separata'"
    },

    {
      "var": "categoria_autonomo",
      "ask": "A quale categoria di lavoratore autonomo appartieni? Scegli tra: artigiano, commerciante, coltivatore_diretto, colono_mezzadro, imprenditore_agricolo, pescatore_autonomo, altra_categoria",
      "type": "string",
      "skip_if": "profilo_lavoratore !== 'autonomo'"
    },

    {
      "var": "contributi_autonomo_regolari",
      "ask": "Hai versato regolarmente i contributi per i mesi del periodo indennizzabile? (sì/no)",
      "type": "boolean",
      "skip_if": "profilo_lavoratore !== 'autonomo'"
    },

    {
      "var": "fase_gravidanza_autonomo",
      "ask": "Quando intendi presentare la domanda? Scegli tra: dopo_parto (gravidanza non a rischio), prima_parto (gravidanza a rischio)",
      "type": "string",
      "skip_if": "profilo_lavoratore !== 'autonomo'"
    },

    {
      "var": "in_naspi_2_mesi_dpp",
      "ask": "Sarai percettore di NASPI al momento corrispondente a 2 mesi dalla Data Parto Prevista (DPP)? (sì/no)",
      "type": "boolean",
      "skip_if": "profilo_lavoratore !== 'naspi'"
    }
  ],

  "reasons_if_fail": [
    {
      "when": "profilo_lavoratore === 'dipendente_pubblico'",
      "reason": "I dipendenti pubblici devono presentare domanda direttamente alla Pubblica Amministrazione di appartenenza. Il pagamento viene effettuato dal Ministero, non dall'INPS. Non è necessario rivolgersi al CAF o Patronato.",
      "check_after_vars": ["profilo_lavoratore"],
      "blocking": true
    },

    {
      "when": "profilo_lavoratore === 'altro'",
      "reason": "La tipologia di lavoratore indicata non è ammessa al congedo di maternità obbligatoria gestito da INPS. Verifica con il tuo datore di lavoro o consulente le modalità specifiche per la tua categoria.",
      "check_after_vars": ["profilo_lavoratore"],
      "blocking": true
    },

    {
      "when": "in_gravidanza === false",
      "reason": "Il congedo di maternità obbligatoria è riservato a persone in stato di gravidanza. Se hai già partorito e non hai ancora presentato domanda, puoi comunque procedere con la domanda per la parte post-parto.",
      "check_after_vars": ["in_gravidanza"],
      "blocking": true
    },

    {
      "when": "profilo_lavoratore === 'gestione_separata' && contributi_gestione_separata === false",
      "reason": "Requisito contributivo non soddisfatto: per i lavoratori iscritti alla Gestione Separata è necessario aver versato almeno 1 contributo mensile con aliquota maggiorata nei 12 mesi precedenti l'inizio del periodo di maternità. Verifica con il tuo commercialista o consulta la tua posizione contributiva sul portale INPS.",
      "check_after_vars": ["profilo_lavoratore", "contributi_gestione_separata"],
      "blocking": true
    },

    {
      "when": "profilo_lavoratore === 'autonomo' && categoria_autonomo === 'altra_categoria'",
      "reason": "Categoria non ammessa: il congedo di maternità per lavoratori autonomi è riservato a: artigiani, commercianti, coltivatori diretti, coloni/mezzadri, imprenditori agricoli professionali, pescatori autonomi piccola pesca. Se appartieni ad altra categoria autonoma, verifica con INPS le tue opzioni.",
      "check_after_vars": ["profilo_lavoratore", "categoria_autonomo"],
      "blocking": true
    },

    {
      "when": "profilo_lavoratore === 'autonomo' && contributi_autonomo_regolari === false",
      "reason": "Requisito contributivo essenziale non soddisfatto: per i lavoratori autonomi è indispensabile la regolarità del versamento dei contributi per i mesi del periodo indennizzabile. Verifica la tua posizione contributiva e regolarizza eventuali arretrati prima di presentare domanda.",
      "check_after_vars": ["profilo_lavoratore", "contributi_autonomo_regolari"],
      "blocking": true
    },

    {
      "when": "profilo_lavoratore === 'naspi' && in_naspi_2_mesi_dpp === false",
      "reason": "Requisito NASPI non soddisfatto: per accedere al congedo di maternità come percettore di NASPI, è necessario essere in NASPI al momento corrispondente a 2 mesi dalla Data Parto Prevista (DPP). Se la tua NASPI terminerà prima di quel momento, verifica con INPS eventuali altre modalità di accesso.",
      "check_after_vars": ["profilo_lavoratore", "in_naspi_2_mesi_dpp"],
      "blocking": true
    }
  ],

  "next_actions_if_ok": [
    "Prenota appuntamento con CAF o Patronato di zona per presentare la domanda",
    "Prepara documento di identità valido (carta identità, patente o passaporto)",
    "Prepara tessera sanitaria valida",
    "Se cittadino extracomunitario: porta permesso di soggiorno valido (o ricevuta rinnovo se scaduto)",
    "PROFILO DIPENDENTE PRIVATO - Prima del parto: porta certificato telematico di gravidanza (3 fogli: ricevuta trasmissione, attestato, certificato fatto da medico SSN) e busta paga",
    "PROFILO DIPENDENTE PRIVATO - Dopo il parto: porta tessera sanitaria del bambino (o certificato anagrafico di nascita se tessera non disponibile), busta paga, e ricevute maternità prima del parto se non gestita dal patronato",
    "PROFILO GESTIONE SEPARATA - Prima del parto: porta certificato telematico di gravidanza, dati gestione (data iscrizione, tipo attività da pagina INPS o commercialista), e IBAN per accredito",
    "PROFILO GESTIONE SEPARATA - Dopo il parto: porta tessera sanitaria del figlio",
    "PROFILO AUTONOMO - Dopo il parto: porta tessera sanitaria figlio, dati gestione (data iscrizione, data inizio attività, certificato P.IVA, tipo gestione), e IBAN per accredito",
    "PROFILO AUTONOMO - Prima del parto (solo se gravidanza a rischio): porta certificato gravidanza a rischio ASL oltre ai documenti standard",
    "PROFILO NASPI - Prima del parto: porta busta paga ultimo datore, documentazione fine rapporto (contratto scaduto, licenziamento, Unilav), certificato telematico gravidanza, e IBAN per accredito",
    "PROFILO NASPI - Dopo il parto: porta tessera sanitaria figlio e ricevute maternità prima parto se non gestite dal patronato",
    "IMPORTANTE: L'indennità è pari all'80% dello stipendio (alcuni CCNL o disposizioni aziendali integrano il restante 20%)",
    "Durante il congedo continui a maturare ferie, permessi, 13ma e 14ma ove previste",
    "Se hai varianti particolari (flessibilità lavorativa, maternità anticipata per mansione a rischio, maternità posticipata per allattamento a rischio, contratto a tempo determinato in scadenza), segnalalo all'operatore del CAF/Patronato che ti indicherà la documentazione aggiuntiva necessaria"
  ]
}
